// #include <stdio.h>
// int main(void)
// {

//  // array = 같은 데이터 타입을 가진 다수의 변수들을 하나의 변수만으로 저장할수 있게 도와주는
//  // 자료구조다.

// int a[10];

// // 잡기술 소개

//   int aa[10] ={1,2,3,4,5,6,7,8,9,10}; // 초기값 정
  
//   // int aa[10] ={0,}; // 0으로 초기화
  
//   // 기본값 설정
//    int i;

//     int i; // = 초기값을 설정하면 이 for문도 필요없음
//    for(i = 0; i<10; i++){
//     a[i] = i+1;
//    }
  
// // 어레이 값 프린트

//   for(i = 0; i<10; i++){
//   printf("\n a[%d] = %d", i, aa[i]);
//     }

//     printf(" size is : %d\n", sizeof(a));
  
  
  
//   return 0;
// }