// #include <stdio.h>

// int main(void)

// {

  // if(조건식) {실행하려는 내용}
  // 조건식 안에 있는 내용이 실행되려면 
  // 조건식의 값이 참!

  // int a, b;

  // a = 10;
  // b = 20;

  // if( a < b ) { // 등호 : ==
          // 부등호 : !=
          // 이상 : <=
          // 이하 : >=
          // 초과 : <
          // 미만 : >
    
    // printf("a는 b보다 작다 \n"); 
     
  // }

   // int c;
  
   // c = 40;
  
  // if( a < b || b < c  ) { 


      // && : and
      // || : or
     

     
     // printf("a는 b보다 작고, b는 c보다 작다");

  // }
     
    // return 0;
// }
